jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32L496/FS_NOR_HW_SPIFI_STM32FL496_ST_STM32L496G_DISCO.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_HW_SPIFI_STM32L496_ST_STM32L496G_DISCO.c
Purpose : Low-level flash driver for STM32L4 QSPI interface.
Literature:
  [1] RM0394 Reference manual STM32L41xxx/42xxx/43xxx/44xxx/45xxx/46xxx advanced Arm-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\RM0351_Rev6.0_STM32L4x6.pdf)
  [2] Errata sheet STM32L496xx and STM32L4A6xx
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\ES0335_Rev13_STM32L496xx_STM32L4A6xx.pdf)
  [3] Datasheet STM32L496xx
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\DS_STM32L496xx_Rev4.pdf)
  [4] UM2169 User manual Discovery kit with STM32L496AG MCU
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\Evalboard\STM32L496-DISCO\en.DM00353127.pdf)
  [5] Datasheet MX25R6435F
    (\\FILESERVER\Techinfo\Company\Macronix\SPI_NOR_Flash\MX25R6435F_v1.4.pdf)

Notes:
  (1) The Macronix MX25R6435F NOR flash device mounted on the evaluation board works by default
      in ultra low power mode. According to [5] the maximum time required to program a page is
      about 10 ms. For this reason the timeout for the write operation configured via
      FS_NOR_TIMEOUT_PAGE_WRITE has to be set to a value greater than or equal to 10.
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_NOR_CLK_HZ
  #define FS_NOR_HW_NOR_CLK_HZ      36000000uL      // Frequency of the clock supplied to NOR flash device
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS          0               // Enables/disables the interrupt-driven operation.
#endif

#ifndef   FS_NOR_HW_USE_DMA
  #define FS_NOR_HW_USE_DMA         0               // Enables/disables the DMA support.
                                                    // Permitted values:
                                                    //   0 - data transferred via CPU
                                                    //   1 - data transferred via DMA
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "RTOS.h"
  #include "stm32l4xx.h"
  #include "FS_OS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       QSPI registers
*/
#define QUADSPI_BASE_ADDR       (0xA0001000u)
#define QUADSPI_CR              (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x00))
#define QUADSPI_DCR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x04))
#define QUADSPI_SR              (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x08))
#define QUADSPI_FCR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x0C))
#define QUADSPI_DLR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x10))
#define QUADSPI_CCR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x14))
#define QUADSPI_AR              (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x18))
#define QUADSPI_ABR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x1C))
#define QUADSPI_DR              (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x20))
#define QUADSPI_DR_BYTE         (*(volatile U8* )(QUADSPI_BASE_ADDR + 0x20))
#define QUADSPI_PSMKR           (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x24))
#define QUADSPI_PSMAR           (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x28))
#define QUADSPI_PIR             (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x2C))
#define QUADSPI_LPTR            (*(volatile U32*)(QUADSPI_BASE_ADDR + 0x30))

/*********************************************************************
*
*       Port A registers
*/
#define GPIOA_BASE_ADDR         (0x48000000u)
#define GPIOA_MODER             (*(volatile U32*)(GPIOA_BASE_ADDR + 0x00))
#define GPIOA_OSPEEDR           (*(volatile U32*)(GPIOA_BASE_ADDR + 0x08))
#define GPIOA_PUPDR             (*(volatile U32*)(GPIOA_BASE_ADDR + 0x0C))
#define GPIOA_ODR               (*(volatile U32*)(GPIOA_BASE_ADDR + 0x14))
#define GPIOA_AFRL              (*(volatile U32*)(GPIOA_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port B registers
*/
#define GPIOB_BASE_ADDR         (0x48000400u)
#define GPIOB_MODER             (*(volatile U32*)(GPIOB_BASE_ADDR + 0x00))
#define GPIOB_OSPEEDR           (*(volatile U32*)(GPIOB_BASE_ADDR + 0x08))
#define GPIOB_PUPDR             (*(volatile U32*)(GPIOB_BASE_ADDR + 0x0C))
#define GPIOB_ODR               (*(volatile U32*)(GPIOB_BASE_ADDR + 0x14))
#define GPIOB_AFRL              (*(volatile U32*)(GPIOB_BASE_ADDR + 0x20))
#define GPIOB_AFRH              (*(volatile U32*)(GPIOB_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Reset and clock control
*/
#define RCC_BASE_ADDR           (0x40021000u)
#define RCC_CFGR                (*(volatile U32*)(RCC_BASE_ADDR + 0x08))
#define RCC_AHB2RSTR            (*(volatile U32*)(RCC_BASE_ADDR + 0x2C))
#define RCC_AHB3RSTR            (*(volatile U32*)(RCC_BASE_ADDR + 0x30))
#define RCC_AHB1ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x48))
#define RCC_AHB2ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x4C))
#define RCC_AHB3ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x50))

/*********************************************************************
*
*       DMA 2 registers
*/
#define DMA2_BASE_ADDR          0x40020400uL
#define DMA2_CHANNEL_INDEX      7
#define DMA2_ISR                (*(volatile U32 *)(DMA2_BASE_ADDR + 0x00))
#define DMA2_IFCR               (*(volatile U32 *)(DMA2_BASE_ADDR + 0x04))
#define DMA2_CCR7               (*(volatile U32 *)(DMA2_BASE_ADDR + 0x08 + 20 * (DMA2_CHANNEL_INDEX - 1)))
#define DMA2_CNDTR7             (*(volatile U32 *)(DMA2_BASE_ADDR + 0x0C + 20 * (DMA2_CHANNEL_INDEX - 1)))
#define DMA2_CPAR7              (*(volatile U32 *)(DMA2_BASE_ADDR + 0x10 + 20 * (DMA2_CHANNEL_INDEX - 1)))
#define DMA2_CMAR7              (*(volatile U32 *)(DMA2_BASE_ADDR + 0x14 + 20 * (DMA2_CHANNEL_INDEX - 1)))
#define DMA2_CSEL               (*(volatile U32 *)(DMA2_BASE_ADDR + 0xA8))

/*********************************************************************
*
*       Masks for the peripheral enable bits
*/
#define AHB2ENR_GPIOAEN         0
#define AHB2ENR_GPIOBEN         1
#define AHB3ENR_QSPIEN          8
#define AHB1ENR_DMA2EN          1

/*********************************************************************
*
*       GPIO bit positions of SPI signals
*/
#define NOR_NCS_BIT             11    // Port B
#define NOR_CLK_BIT             3     // Port A
#define NOR_D0_BIT              1     // Port B
#define NOR_D1_BIT              0     // Port B
#define NOR_D2_BIT              7     // Port A
#define NOR_D3_BIT              6     // Port A

/*********************************************************************
*
*       GPIO bits and masks
*/
#define OSPEEDR_HIGH            0x2uL
#define OSPEEDR_MASK            0x3uL
#define MODER_ALT               0x2uL
#define MODER_MASK              0x3uL
#define AFR_MASK                0xFuL

/*********************************************************************
*
*       Quad-SPI control register
*/
#define CR_EN_BIT               0
#define CR_ABORT_BIT            1
#define CR_DMAEN_BIT            2
#define CR_FTHRES_BIT           8
#define CR_FTHRES_MASK          0x1Fu
#define CR_TRIE_BIT             16
#define CR_TCIE_BIT             17
#define CR_FTIE_BIT             18
#define CR_SMIE_BIT             19
#define CR_TOIE_BIT             20
#define CR_APMS_BIT             22
#define CR_PRESCALER_BIT        24
#define CR_PRESCALER_MAX        0xFFu

/*********************************************************************
*
*       Quad-SPI device configuration register
*/
#define DCR_CKMODE_BIT          0
#define DCR_FSIZE_BIT           16
#define DCR_FSIZE_MAX           0x1Fu

/*********************************************************************
*
*       Quad-SPI status register
*/
#define SR_TEF_BIT              0
#define SR_TCF_BIT              1
#define SR_FTF_BIT              2
#define SR_SMF_BIT              3
#define SR_TOF_BIT              4
#define SR_BUSY_BIT             5
#define SR_FLEVEL_BIT           8
#define SR_FLEVEL_MASK          0x1Fu

/*********************************************************************
*
*       Quad-SPI communication configuration register
*/
#define CCR_INTRUCTION_BIT      0
#define CCR_IMODE_BIT           8
#define CCR_ADMODE_BIT          10
#define CCR_ADSIZE_BIT          12
#define CCR_ABMODE_BIT          14
#define CCR_ABSIZE_BIT          16
#define CCR_DCYC_BIT            18
#define CCR_DMODE_BIT           24
#define CCR_FMODE_BIT           26
#define CCR_MODE_NONE           0x00uL
#define CCR_MODE_SINGLE         0x01uL
#define CCR_MODE_DUAL           0x02uL
#define CCR_MODE_QUAD           0x03uL
#define CCR_ADSIZE_MASK         0x03uL
#define CCR_ABSIZE_MASK         0x03uL
#define CCR_FMODE_WRITE         0x00uL
#define CCR_FMODE_READ          0x01uL
#define CCR_FMODE_POLL          0x02uL
#define CCR_FMODE_MMAP          0x03uL
#define CCR_FMODE_MASK          0x03uL

/*********************************************************************
*
*       DMA2 related defines
*/
#define IFCR_CGIF7_BIT          24
#define IFCR_CTCIF7_BIT         25
#define IFCR_CHTIF7_BIT         26
#define IFCR_CTEIF7_BIT         27
#define ISR_FEIF7_BIT           22
#define ISR_TEIF7_BIT           25
#define ISR_TCIF7_BIT           27
#define DCCR_EN_BIT             0
#define DCCR_TCIE_BIT           1
#define DCCR_TEIE_BIT           3
#define DCCR_DIR_M2P            1uL
#define DCCR_DIR_BIT            4
#define DCCR_PINC_BIT           6
#define DCCR_MINC_BIT           7
#define DCCR_PSIZE_32BIT        2uL
#define DCCR_PSIZE_BIT          8
#define DCCR_MSIZE_32BIT        2uL
#define DCCR_MSIZE_BIT          10
#define DCCR_PRIO_HIGH          3uL
#define DCCR_PRIO_BIT           12
#define CSELR_CHSEL_QUADSPI     3
#define CSELR_CHSEL_BIT         24
#define CSELR_CHSEL_MASK        0x0FuL

/*********************************************************************
*
*       Misc. defines
*/
#define NUM_BYTES_FIFO          16
#define QUADSPI_PRIO            15
#define DMA2_PRIO               15
#define WAIT_TIMEOUT_MS         1000
#define CYCLES_PER_MS           150           // Blocks the execution for about 1ms on a CPU running at 78 Mhz.
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * CYCLES_PER_MS)

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/
extern unsigned int SystemCoreClock;

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  static volatile U32 _StatusQSPI;
#if FS_NOR_HW_USE_DMA
  static volatile U32 _StatusDMA;
#endif
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _CalcClockDivider
*/
static U32 _CalcClockDivider(U32 * pFreq_Hz) {
  U32 Div;
  U32 Freq_Hz;
  U32 MaxFreq_Hz;
  U32 PerClkFreq_Hz;
  U32 AHBPre;
  U32 HPre;

  //
  // Calculate the frequency of the clock supplied to QSPI peripheral.
  //
  HPre          = (RCC_CFGR >> 4) & 0x0FuL;
  AHBPre        = (HPre & 0x08) ? 2uL << (HPre & 0x07) : 1uL;
  PerClkFreq_Hz = (SystemCoreClock / AHBPre);
  //
  // Calculate the divider for the specified QSPI frequency.
  //
  Div        = 0;
  MaxFreq_Hz = *pFreq_Hz;
  for (;;) {
    Freq_Hz = PerClkFreq_Hz / (Div + 1u);
    if (Freq_Hz <= MaxFreq_Hz) {
      break;
    }
    ++Div;
    if (Div == CR_PRESCALER_MAX) {
      break;
    }
  }
  *pFreq_Hz = Freq_Hz;
  return Div;
}

/*********************************************************************
*
*       _GetMode
*/
static U32 _GetMode(unsigned BusWidth, U32 NumBytes) {
  U32 Mode;

